MikroElektronika/core_packages/PIC/XC8/def/PIC16F1716/mcu.h
// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
extern volatile unsigned char           DAC1CON0            __at(0x118);
#ifndef _LIB_BUILD
asm("DAC1CON0 equ 0118h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1NSS                :1;
        unsigned                        :1;
        unsigned DAC1PSS                :2;
        unsigned DAC1OE2                :1;
        unsigned DAC1OE1                :1;
        unsigned                        :1;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
    };
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned DACOE0                 :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
} DAC1CON0bits_t;
extern volatile DAC1CON0bits_t DAC1CON0bits __at(0x118);
// bitfield macros
#define _DAC1CON0_DAC1NSS_POSN                              0x0
#define _DAC1CON0_DAC1NSS_POSITION                          0x0
#define _DAC1CON0_DAC1NSS_SIZE                              0x1
#define _DAC1CON0_DAC1NSS_LENGTH                            0x1
#define _DAC1CON0_DAC1NSS_MASK                              0x1
#define _DAC1CON0_DAC1PSS_POSN                              0x2
#define _DAC1CON0_DAC1PSS_POSITION                          0x2
#define _DAC1CON0_DAC1PSS_SIZE                              0x2
#define _DAC1CON0_DAC1PSS_LENGTH                            0x2
#define _DAC1CON0_DAC1PSS_MASK                              0xC
#define _DAC1CON0_DAC1OE2_POSN                              0x4
#define _DAC1CON0_DAC1OE2_POSITION                          0x4
#define _DAC1CON0_DAC1OE2_SIZE                              0x1
#define _DAC1CON0_DAC1OE2_LENGTH                            0x1
#define _DAC1CON0_DAC1OE2_MASK                              0x10
#define _DAC1CON0_DAC1OE1_POSN                              0x5
#define _DAC1CON0_DAC1OE1_POSITION                          0x5
#define _DAC1CON0_DAC1OE1_SIZE                              0x1
#define _DAC1CON0_DAC1OE1_LENGTH                            0x1
#define _DAC1CON0_DAC1OE1_MASK                              0x20
#define _DAC1CON0_DAC1EN_POSN                               0x7
#define _DAC1CON0_DAC1EN_POSITION                           0x7
#define _DAC1CON0_DAC1EN_SIZE                               0x1
#define _DAC1CON0_DAC1EN_LENGTH                             0x1
#define _DAC1CON0_DAC1EN_MASK                               0x80
#define _DAC1CON0_DAC1PSS0_POSN                             0x2
#define _DAC1CON0_DAC1PSS0_POSITION                         0x2
#define _DAC1CON0_DAC1PSS0_SIZE                             0x1
#define _DAC1CON0_DAC1PSS0_LENGTH                           0x1
#define _DAC1CON0_DAC1PSS0_MASK                             0x4
#define _DAC1CON0_DAC1PSS1_POSN                             0x3
#define _DAC1CON0_DAC1PSS1_POSITION                         0x3
#define _DAC1CON0_DAC1PSS1_SIZE                             0x1
#define _DAC1CON0_DAC1PSS1_LENGTH                           0x1
#define _DAC1CON0_DAC1PSS1_MASK                             0x8
#define _DAC1CON0_DACNSS_POSN                               0x0
#define _DAC1CON0_DACNSS_POSITION                           0x0
#define _DAC1CON0_DACNSS_SIZE                               0x1
#define _DAC1CON0_DACNSS_LENGTH                             0x1
#define _DAC1CON0_DACNSS_MASK                               0x1
#define _DAC1CON0_DACPSS_POSN                               0x2
#define _DAC1CON0_DACPSS_POSITION                           0x2
#define _DAC1CON0_DACPSS_SIZE                               0x2
#define _DAC1CON0_DACPSS_LENGTH                             0x2
#define _DAC1CON0_DACPSS_MASK                               0xC
#define _DAC1CON0_DACOE0_POSN                               0x4
#define _DAC1CON0_DACOE0_POSITION                           0x4
#define _DAC1CON0_DACOE0_SIZE                               0x1
#define _DAC1CON0_DACOE0_LENGTH                             0x1
#define _DAC1CON0_DACOE0_MASK                               0x10
#define _DAC1CON0_DACOE1_POSN                               0x5
#define _DAC1CON0_DACOE1_POSITION                           0x5
#define _DAC1CON0_DACOE1_SIZE                               0x1
#define _DAC1CON0_DACOE1_LENGTH                             0x1
#define _DAC1CON0_DACOE1_MASK                               0x20
#define _DAC1CON0_DACEN_POSN                                0x7
#define _DAC1CON0_DACEN_POSITION                            0x7
#define _DAC1CON0_DACEN_SIZE                                0x1
#define _DAC1CON0_DACEN_LENGTH                              0x1
#define _DAC1CON0_DACEN_MASK                                0x80
#define _DAC1CON0_DACPSS0_POSN                              0x2
#define _DAC1CON0_DACPSS0_POSITION                          0x2
#define _DAC1CON0_DACPSS0_SIZE                              0x1
#define _DAC1CON0_DACPSS0_LENGTH                            0x1
#define _DAC1CON0_DACPSS0_MASK                              0x4
#define _DAC1CON0_DACPSS1_POSN                              0x3
#define _DAC1CON0_DACPSS1_POSITION                          0x3
#define _DAC1CON0_DACPSS1_SIZE                              0x1
#define _DAC1CON0_DACPSS1_LENGTH                            0x1
#define _DAC1CON0_DACPSS1_MASK                              0x8

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
extern volatile unsigned char           DAC1CON1            __at(0x119);
#ifndef _LIB_BUILD
asm("DAC1CON1 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :8;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
        unsigned DAC1R5                 :1;
        unsigned DAC1R6                 :1;
        unsigned DAC1R7                 :1;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
        unsigned DACR5                  :1;
        unsigned DACR6                  :1;
        unsigned DACR7                  :1;
    };
} DAC1CON1bits_t;
extern volatile DAC1CON1bits_t DAC1CON1bits __at(0x119);
// bitfield macros
#define _DAC1CON1_DAC1R_POSN                                0x0
#define _DAC1CON1_DAC1R_POSITION                            0x0
#define _DAC1CON1_DAC1R_SIZE                                0x8
#define _DAC1CON1_DAC1R_LENGTH                              0x8
#define _DAC1CON1_DAC1R_MASK                                0xFF
#define _DAC1CON1_DAC1R0_POSN                               0x0
#define _DAC1CON1_DAC1R0_POSITION                           0x0
#define _DAC1CON1_DAC1R0_SIZE                               0x1
#define _DAC1CON1_DAC1R0_LENGTH                             0x1
#define _DAC1CON1_DAC1R0_MASK                               0x1
#define _DAC1CON1_DAC1R1_POSN                               0x1
#define _DAC1CON1_DAC1R1_POSITION                           0x1
#define _DAC1CON1_DAC1R1_SIZE                               0x1
#define _DAC1CON1_DAC1R1_LENGTH                             0x1
#define _DAC1CON1_DAC1R1_MASK                               0x2
#define _DAC1CON1_DAC1R2_POSN                               0x2
#define _DAC1CON1_DAC1R2_POSITION                           0x2
#define _DAC1CON1_DAC1R2_SIZE                               0x1
#define _DAC1CON1_DAC1R2_LENGTH                             0x1
#define _DAC1CON1_DAC1R2_MASK                               0x4
#define _DAC1CON1_DAC1R3_POSN                               0x3
#define _DAC1CON1_DAC1R3_POSITION                           0x3
#define _DAC1CON1_DAC1R3_SIZE                               0x1
#define _DAC1CON1_DAC1R3_LENGTH                             0x1
#define _DAC1CON1_DAC1R3_MASK                               0x8
#define _DAC1CON1_DAC1R4_POSN                               0x4
#define _DAC1CON1_DAC1R4_POSITION                           0x4
#define _DAC1CON1_DAC1R4_SIZE                               0x1
#define _DAC1CON1_DAC1R4_LENGTH                             0x1
#define _DAC1CON1_DAC1R4_MASK                               0x10
#define _DAC1CON1_DAC1R5_POSN                               0x5
#define _DAC1CON1_DAC1R5_POSITION                           0x5
#define _DAC1CON1_DAC1R5_SIZE                               0x1
#define _DAC1CON1_DAC1R5_LENGTH                             0x1
#define _DAC1CON1_DAC1R5_MASK                               0x20
#define _DAC1CON1_DAC1R6_POSN                               0x6
#define _DAC1CON1_DAC1R6_POSITION                           0x6
#define _DAC1CON1_DAC1R6_SIZE                               0x1
#define _DAC1CON1_DAC1R6_LENGTH                             0x1
#define _DAC1CON1_DAC1R6_MASK                               0x40
#define _DAC1CON1_DAC1R7_POSN                               0x7
#define _DAC1CON1_DAC1R7_POSITION                           0x7
#define _DAC1CON1_DAC1R7_SIZE                               0x1
#define _DAC1CON1_DAC1R7_LENGTH                             0x1
#define _DAC1CON1_DAC1R7_MASK                               0x80
#define _DAC1CON1_DACR0_POSN                                0x0
#define _DAC1CON1_DACR0_POSITION                            0x0
#define _DAC1CON1_DACR0_SIZE                                0x1
#define _DAC1CON1_DACR0_LENGTH                              0x1
#define _DAC1CON1_DACR0_MASK                                0x1
#define _DAC1CON1_DACR1_POSN                                0x1
#define _DAC1CON1_DACR1_POSITION                            0x1
#define _DAC1CON1_DACR1_SIZE                                0x1
#define _DAC1CON1_DACR1_LENGTH                              0x1
#define _DAC1CON1_DACR1_MASK                                0x2
#define _DAC1CON1_DACR2_POSN                                0x2
#define _DAC1CON1_DACR2_POSITION                            0x2
#define _DAC1CON1_DACR2_SIZE                                0x1
#define _DAC1CON1_DACR2_LENGTH                              0x1
#define _DAC1CON1_DACR2_MASK                                0x4
#define _DAC1CON1_DACR3_POSN                                0x3
#define _DAC1CON1_DACR3_POSITION                            0x3
#define _DAC1CON1_DACR3_SIZE                                0x1
#define _DAC1CON1_DACR3_LENGTH                              0x1
#define _DAC1CON1_DACR3_MASK                                0x8
#define _DAC1CON1_DACR4_POSN                                0x4
#define _DAC1CON1_DACR4_POSITION                            0x4
#define _DAC1CON1_DACR4_SIZE                                0x1
#define _DAC1CON1_DACR4_LENGTH                              0x1
#define _DAC1CON1_DACR4_MASK                                0x10
#define _DAC1CON1_DACR5_POSN                                0x5
#define _DAC1CON1_DACR5_POSITION                            0x5
#define _DAC1CON1_DACR5_SIZE                                0x1
#define _DAC1CON1_DACR5_LENGTH                              0x1
#define _DAC1CON1_DACR5_MASK                                0x20
#define _DAC1CON1_DACR6_POSN                                0x6
#define _DAC1CON1_DACR6_POSITION                            0x6
#define _DAC1CON1_DACR6_SIZE                                0x1
#define _DAC1CON1_DACR6_LENGTH                              0x1
#define _DAC1CON1_DACR6_MASK                                0x40
#define _DAC1CON1_DACR7_POSN                                0x7
#define _DAC1CON1_DACR7_POSITION                            0x7
#define _DAC1CON1_DACR7_SIZE                                0x1
#define _DAC1CON1_DACR7_LENGTH                              0x1
#define _DAC1CON1_DACR7_MASK                                0x80

// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
extern volatile unsigned char           DAC2CON0            __at(0x11A);
#ifndef _LIB_BUILD
asm("DAC2CON0 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :1;
        unsigned                        :1;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
    struct {
        unsigned DAC2NSS                :1;
        unsigned                        :1;
        unsigned DAC2PSS                :2;
        unsigned DAC2OE2                :1;
        unsigned DAC2OE1                :1;
        unsigned                        :1;
        unsigned DAC2EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned DAC2PSS0               :1;
        unsigned DAC2PSS1               :1;
    };
} DAC2CON0bits_t;
extern volatile DAC2CON0bits_t DAC2CON0bits __at(0x11A);
// bitfield macros
#define _DAC2CON0_NSS_POSN                                  0x0
#define _DAC2CON0_NSS_POSITION                              0x0
#define _DAC2CON0_NSS_SIZE                                  0x1
#define _DAC2CON0_NSS_LENGTH                                0x1
#define _DAC2CON0_NSS_MASK                                  0x1
#define _DAC2CON0_PSS_POSN                                  0x2
#define _DAC2CON0_PSS_POSITION                              0x2
#define _DAC2CON0_PSS_SIZE                                  0x2
#define _DAC2CON0_PSS_LENGTH                                0x2
#define _DAC2CON0_PSS_MASK                                  0xC
#define _DAC2CON0_OE2_POSN                                  0x4
#define _DAC2CON0_OE2_POSITION                              0x4
#define _DAC2CON0_OE2_SIZE                                  0x1
#define _DAC2CON0_OE2_LENGTH                                0x1
#define _DAC2CON0_OE2_MASK                                  0x10
#define _DAC2CON0_OE1_POSN                                  0x5
#define _DAC2CON0_OE1_POSITION                              0x5
#define _DAC2CON0_OE1_SIZE                                  0x1
#define _DAC2CON0_OE1_LENGTH                                0x1
#define _DAC2CON0_OE1_MASK                                  0x20
#define _DAC2CON0_EN_POSN                                   0x7
#define _DAC2CON0_EN_POSITION                               0x7
#define _DAC2CON0_EN_SIZE                                   0x1
#define _DAC2CON0_EN_LENGTH                                 0x1
#define _DAC2CON0_EN_MASK                                   0x80
#define _DAC2CON0_PSS0_POSN                                 0x2
#define _DAC2CON0_PSS0_POSITION                             0x2
#define _DAC2CON0_PSS0_SIZE                                 0x1
#define _DAC2CON0_PSS0_LENGTH                               0x1
#define _DAC2CON0_PSS0_MASK                                 0x4
#define _DAC2CON0_PSS1_POSN                                 0x3
#define _DAC2CON0_PSS1_POSITION                             0x3
#define _DAC2CON0_PSS1_SIZE                                 0x1
#define _DAC2CON0_PSS1_LENGTH                               0x1
#define _DAC2CON0_PSS1_MASK                                 0x8
#define _DAC2CON0_DACNSS_POSN                               0x0
#define _DAC2CON0_DACNSS_POSITION                           0x0
#define _DAC2CON0_DACNSS_SIZE                               0x1
#define _DAC2CON0_DACNSS_LENGTH                             0x1
#define _DAC2CON0_DACNSS_MASK                               0x1
#define _DAC2CON0_DACPSS_POSN                               0x2
#define _DAC2CON0_DACPSS_POSITION                           0x2
#define _DAC2CON0_DACPSS_SIZE                               0x2
#define _DAC2CON0_DACPSS_LENGTH                             0x2
#define _DAC2CON0_DACPSS_MASK                               0xC
#define _DAC2CON0_DACOE2_POSN                               0x4
#define _DAC2CON0_DACOE2_POSITION                           0x4
#define _DAC2CON0_DACOE2_SIZE                               0x1
#define _DAC2CON0_DACOE2_LENGTH                             0x1
#define _DAC2CON0_DACOE2_MASK                               0x10
#define _DAC2CON0_DACOE1_POSN                               0x5
#define _DAC2CON0_DACOE1_POSITION                           0x5
#define _DAC2CON0_DACOE1_SIZE                               0x1
#define _DAC2CON0_DACOE1_LENGTH                             0x1
#define _DAC2CON0_DACOE1_MASK                               0x20
#define _DAC2CON0_DACEN_POSN                                0x7
#define _DAC2CON0_DACEN_POSITION                            0x7
#define _DAC2CON0_DACEN_SIZE                                0x1
#define _DAC2CON0_DACEN_LENGTH                              0x1
#define _DAC2CON0_DACEN_MASK                                0x80
#define _DAC2CON0_DACPSS0_POSN                              0x2
#define _DAC2CON0_DACPSS0_POSITION                          0x2
#define _DAC2CON0_DACPSS0_SIZE                              0x1
#define _DAC2CON0_DACPSS0_LENGTH                            0x1
#define _DAC2CON0_DACPSS0_MASK                              0x4
#define _DAC2CON0_DACPSS1_POSN                              0x3
#define _DAC2CON0_DACPSS1_POSITION                          0x3
#define _DAC2CON0_DACPSS1_SIZE                              0x1
#define _DAC2CON0_DACPSS1_LENGTH                            0x1
#define _DAC2CON0_DACPSS1_MASK                              0x8
#define _DAC2CON0_DAC2NSS_POSN                              0x0
#define _DAC2CON0_DAC2NSS_POSITION                          0x0
#define _DAC2CON0_DAC2NSS_SIZE                              0x1
#define _DAC2CON0_DAC2NSS_LENGTH                            0x1
#define _DAC2CON0_DAC2NSS_MASK                              0x1
#define _DAC2CON0_DAC2PSS_POSN                              0x2
#define _DAC2CON0_DAC2PSS_POSITION                          0x2
#define _DAC2CON0_DAC2PSS_SIZE                              0x2
#define _DAC2CON0_DAC2PSS_LENGTH                            0x2
#define _DAC2CON0_DAC2PSS_MASK                              0xC
#define _DAC2CON0_DAC2OE2_POSN                              0x4
#define _DAC2CON0_DAC2OE2_POSITION                          0x4
#define _DAC2CON0_DAC2OE2_SIZE                              0x1
#define _DAC2CON0_DAC2OE2_LENGTH                            0x1
#define _DAC2CON0_DAC2OE2_MASK                              0x10
#define _DAC2CON0_DAC2OE1_POSN                              0x5
#define _DAC2CON0_DAC2OE1_POSITION                          0x5
#define _DAC2CON0_DAC2OE1_SIZE                              0x1
#define _DAC2CON0_DAC2OE1_LENGTH                            0x1
#define _DAC2CON0_DAC2OE1_MASK                              0x20
#define _DAC2CON0_DAC2EN_POSN                               0x7
#define _DAC2CON0_DAC2EN_POSITION                           0x7
#define _DAC2CON0_DAC2EN_SIZE                               0x1
#define _DAC2CON0_DAC2EN_LENGTH                             0x1
#define _DAC2CON0_DAC2EN_MASK                               0x80
#define _DAC2CON0_DAC2PSS0_POSN                             0x2
#define _DAC2CON0_DAC2PSS0_POSITION                         0x2
#define _DAC2CON0_DAC2PSS0_SIZE                             0x1
#define _DAC2CON0_DAC2PSS0_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS0_MASK                             0x4
#define _DAC2CON0_DAC2PSS1_POSN                             0x3
#define _DAC2CON0_DAC2PSS1_POSITION                         0x3
#define _DAC2CON0_DAC2PSS1_SIZE                             0x1
#define _DAC2CON0_DAC2PSS1_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS1_MASK                             0x8

// Register: DAC2REF
#define DAC2REF DAC2REF
extern volatile unsigned char           DAC2REF             __at(0x11B);
#ifndef _LIB_BUILD
asm("DAC2REF equ 011Bh");
#endif
// aliases
extern volatile unsigned char           DAC2CON1            __at(0x11B);
#ifndef _LIB_BUILD
asm("DAC2CON1 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC2R                  :5;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
    };
    struct {
        unsigned DAC2REF0               :1;
        unsigned DAC2REF1               :1;
        unsigned DAC2REF2               :1;
        unsigned DAC2REF3               :1;
        unsigned DAC2REF4               :1;
        unsigned DAC2REF5               :1;
    };
} DAC2REFbits_t;
